-- 테스트 데이터 삽입
INSERT INTO article (article_id, title, content, image_url, url, created_at, updated_at) VALUES
                                                                                  (1, '기사제목1', '내용1','default.png', 'http://example.com/1', '2025-12-06 15:00:00', '2025-12-06 15:00:00'),
                                                                                  (2, '기사제목2', '내용2', 'default.png','http://example.com/2', '2025-12-06 14:00:00', '2025-12-06 14:00:00'),
                                                                                  (3, '기사제목3', '내용3', 'default.png','http://example.com/3', '2025-12-06 13:00:00', '2025-12-06 13:00:00'),
                                                                                  (4, '기사제목4', '내용4', 'default.png','http://example.com/4', '2025-12-06 12:00:00', '2025-12-06 12:00:00'),
                                                                                  (5, '기사제목5', '내용5', 'default.png','http://example.com/5', '2025-12-06 11:00:00', '2025-12-06 11:00:00'),
                                                                                  (6, '기사제목6', '내용6', 'default.png','http://example.com/6', '2025-12-06 10:00:00', '2025-12-06 10:00:00'),
                                                                                  (7, '기사제목7', '내용7', 'default.png','http://example.com/7', '2025-12-06 09:00:00', '2025-12-06 09:00:00'),
                                                                                  (8, '기사제목8', '내용8', 'default.png','http://example.com/8', '2025-12-06 08:00:00', '2025-12-06 08:00:00'),
                                                                                  (9, '기사제목9', '내용9', 'default.png','http://example.com/9', '2025-12-06 07:00:00', '2025-12-06 07:00:00'),
                                                                                  (10, '기사제목10', '내용10','default.png', 'http://example.com/10', '2025-12-06 06:00:00', '2025-12-06 06:00:00');

-- 태그 데이터
INSERT INTO tag (tag_id, name, article_id) VALUES
                                               (1, '태그1', 1),
                                               (2, '태그2', 1),
                                               (3, '태그3', 1),
                                               (4, '태그1', 2),
                                               (5, '태그2', 2);